package java_basic;

public class D005_Q1_Lottery {

	public static void main(String[] args) {
//======================2023.11.23======================//
//		로또 프로그램을 작성하시오						//
//		(1부터 45 사이의 임의의 숫자 6개)				//
//														//
//		실행)					실행)					//
//		금액을 입력 : 1000		금액을 입력  : 3200		//
//		34 23 22 21 11 2		22 33 21 20 11 2		//
//								43 23 11 19 18 7		//
//								27 12 13 16 34 15		//
//								거스름돈 : ￦200		//
//======================================================//


	}

}
